app/views/users/show.html.erb


    <% @user.liked_chats.each do |liked_chat|  %>
---
SELECT `like_chats`.* FROM `like_chats` WHERE `like_chats`.`user_id` = 84