app/controllers/chats_controller.rb

INSERT INTO `chats` (`user_id`, `text`, `created_at`, `updated_at`) VALUES (256, 'hoge', '2019-08-20 14:52:58', '2019-08-20 14:52:58')
---
	def create
		Chat.create(create_params)

SELECT `like_chats`.* FROM `like_chats` WHERE `like_chats`.`chat_id` = 11
DELETE FROM `chats` WHERE `chats`.`id` = 11
---
	def destroy
		chat = Chat.find(params[:id])
		chat.destroy