app/controllers/diaries_controller.rb

	def create
		Diary.create(create_params)
---
INSERT INTO `diaries` (`user_id`, `text`, `created_at`, `updated_at`) VALUES (302, 'hoge', '2019-08-20 15:44:37', '2019-08-20 15:44:37')

	def destroy
		diary = Diary.find(params[:id])
		diary.destroy
---
SELECT `like_diaries`.* FROM `like_diaries` WHERE `like_diaries`.`diary_id` = 9
DELETE FROM `diaries` WHERE `diaries`.`id` = 9