app/controllers/events_controller.rb

	def create
		@event = Event.create(event_params)
---
INSERT INTO `events` (`event_date`, `prefecture`, `court`, `court_url`, `meeting_place`, `meeting_time`, `access`, `budget`, `max_member`, `racket`, `remarks`, `user_id`, `created_at`, `updated_at`) VALUES ('2018-05-31', '東京都', 'ほげ', 'http://www.netyasun.com/home/color.html', '南町田駅', '09:00:00', '町田駅', 500, 5, 1, '南町田駅', 26, '2019-08-18 22:25:11', '2019-08-18 22:25:11')

	def edit
		@event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 15 LIMIT 1

	def update
		@event = Event.find(params[:id])
		@event.update(update_params)
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 156 LIMIT 1
UPDATE `events` SET `prefecture` = 'hoge', `updated_at` = '2019-08-16 20:17:39' WHERE `events`.`id` = 157

	def show
		@event = Event.includes(:groups, :like_events).find(params[:id])
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`event_id` = 33
SELECT `like_events`.* FROM `like_events` WHERE `like_events`.`event_id` = 33

	def destroy
		event = Event.find(params[:id])
		event.destroy
---
SELECT `like_events`.* FROM `like_events` WHERE `like_events`.`event_id` = 152
DELETE FROM `events` WHERE `events`.`id` = 152