app/controllers/users_controller.rb

	def show
		@user = User.includes(:events, :comments, :commented_events, :like_events, :diaries, :like_chats, :like_diaries, :like_infos).find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 545 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`user_id` = 84
SELECT `like_chats`.* FROM `like_chats` WHERE `like_chats`.`user_id` = 84
SELECT `like_diaries`.* FROM `like_diaries` WHERE `like_diaries`.`user_id` = 84

	def update
		current_user.update(update_params)
---
UPDATE `users` SET `nickname` = 'hoge', `updated_at` = '2019-08-20 13:35:47' WHERE `users`.`id` = 169